package com.example.lmasi.hangsho;

import android.graphics.Point;

/**
 * Created by lmasi on 2016-09-17.
 */
public class Resources {

    public static String[] locations =
            {
                    "서울-강북",
                    "서울-강남",
                    "분당/판교",
                    "일산/고양",
                    "수원",
                    "안양",
                    "경기",
                    "부산",
                    "대구",
                    "인천",
                    "대전",
                    "광주",
                    "울산",
                    "세종",
                    "강원",
                    "전북",
                    "전남",
                    "경북",
                    "경남",
                    "충북",
                    "충남",
                    "제주"
            };

    public static String[][] specific_locations =
            {
                    {"건대/군자",		"경복궁",		"광화문/시청",		"남산/충무로",  	"노원/도봉",		"대학로",		"동대문",		"마포/공덕",		"명동",		"부암동",		"상수",		"상암",		"성북",		"수유/미아",		"신촌",		"연남/연희",		"왕십리/한양대",		"용산",		"은평",		"이대",		"이태원/경리단길",		"인사동/삼청동",		"종로",		"한남동",		"합정",		"홍대",		"회기" },
                    {"강남/역삼",		"강서/화곡",		"구로/금천",		"노량진/동작",		"목동",		"삼성",		"서래마을/반포",		"서울대입구",		"신림",		"신사/가로수길",		"신천/잠실",		"압구정",		"양재/서초",		"여의도",		"영등포/신도림",		"이수/사당",		"천호",		"청담"},
                    {"미금/오리",		"서현",		"성남",		"야탑/이매",		"정자/수내",		"판교" },
                    {"일산호수공원",		"주엽/대화/탄현",		"풍동",		"화정/덕양구"},
                    {"광교",		"남문",		"성균관대",		"수원역",		"아주대",		"영통",		"인계" },
                    {"일번가",		"평촌/범계"},
                    {"가평",		"과천",		"광명",		"광주",		"구리",		"군포",		"김포",		"남양주",		"동두천",		"부천",		"시흥",		"안산",		"안성",		"양주",		"양평",		"여주",		"연천",		"오산",		"용인",		"의왕",		"의정부",		"이천",		"파주",		"평택",		"포천",		"하남",		"화성" },
                    {	"경성대",		"광안리",		"부산대",		"사상/북구",		"사하구",		"서면",		"중구/서구/동구",		"태종대",		"해운대"},
                    {"계대/성서",		"달성군",		"동대구역/신천",		"동성로/중앙로/반월당",		"두류/내당/서문시장",		"범어/수성",		"북구",		"상인/송현/월배",		"앞산",		"팔공산" },
                    {"강화도",		"구월동 로데오거리",		"동인천",		"부평",		"소래포구",		"송도",		"연수구",		"영종도",		"옹진군",		"월미도",		"을왕리",		"인하대",		"작전",		"제물포",		"주안",		"청라" },
                    {"대덕구",		"동구",		"서구",		"유성구",		"중구"},
                    {"광산구",		"남구",		"동구",		"북구",		"서구"},
                    {"간절곶",		"병영",		"삼산/태화강",		"성남동",		"성안동",		"수변공원",		"울산대공원",		"일산지",		"정자",		"진하"},
                    {"세종"},
                    {"강릉",		"고성",		"동해",		"삼척",		"속초",		"양구",		"양양",		"영월",		"원주",		"인제",		"정선",		"철원",		"춘천",		"태백",		"평창",		"홍천",		"화천",		"횡성" },
                    {"고창군",		"군산시",		"김제시",		"남원시",		"무주군",		"부안군",		"순창군",		"완주군",		"익산시",		"임실군",		"장수군",		"전주시 덕진구",		"전주시 완산구",		"정읍시",		"진안군" },
                    {"강진군",		"고흥군",		"곡성군",		"광양시",		"구례군",		"나주시",		"담양군",		"목포시",		"무안군",		"보성군",		"순천시",		"신안군",		"여수시",		"영광군",		"영암군",		"완도군",		"장성군",		"장흥군",		"진도군",		"함평군",		"해남군",		"화순군"},
                    {"경산시",		"경주시",		"고령군",		"구미시",		"군위군",		"김천시",		"문경시",		"봉화군",		"상주시",		"성주군",		"안동시",		"영덕군",		"영양군",		"영주시",		"영천시",		"예천군",		"울릉군",		"의성군",		"청도군",		"청송군",		"칠곡군",		"포항시 남구",		"포항시 북구"},
                    {	"거제시",		"거창군",		"고성군",		"김해시",		"남해군",		"밀양시",		"사천시",		"산청군",		"양산시",		"의령군",		"진주시",		"창녕군",		"창원시 마산합포구",		"창원시 마산회원구",		"창원시 성산구",		"창원시 의창구",		"창원시 진해구",		"통영시",		"하동군",		"함안군",		"함양군",		"합천군" },
                    {"괴산군",		"단양군",		"보은군",		"영동군",		"옥천군",		"음성군",		"제천시",		"증평군",		"진천군",		"청주시 상당구",		"청주시 서원구",		"청주시 청원구",		"청주시 흥덕구",		"충주시"},
                    {"계룡시",		"공주시",		"금산군",		"논산시",		"당진군",		"보령시",		"부여군",		"서산시",		"서천군",		"아산시",		"예산군",		"천안시 동남구",		"천안시 서북구",		"청양군",		"태안군",		"홍성군"},
                    {"서귀포시",		"제주시" }
            };

    public static String[] coupons =
            {
                    "하루종일\n" +
                            "혼자있게 해주기",
                    "1박 2일 여행권\n" +
                            "(단, 일주일 전에 예약 필수)",
                    "밤새 술마시는데\n" +
                            "전화 안하기",
                    "군대 썰\n" +
                            "무조건 들어주기",
                    "다음번 데이트때\n" +
                            "내가 원하는대로 입기",
                    "하루종일 내 손\n" +
                            "절대 먼저 놓지말기",
                    "3일동안 게임한다고\n" +
                            "잔소리하지 않기",
                    "카톡 상태메세지\n" +
                            "상내가 원하는대로\n" +
                            "3일동안안 해놓기",
                    "오버워치\n" +
                            "같이하기",
                    "내가 화났을 때\n" +
                            "무조건 용서해주기",
                    "우리집 데려다주기",
                    "내가 원하는 노래\n" +
                            "불러주기"
            };

    public static String[] STORENAME =
            {
                    "골져스 토일렛",
                    "데일리먼데이",
                    "디와이에스",
                    "레이트",
                    "스타일베리",
                    "원더플레이스",
                    "이란지",
                    "엠소울",
                    "윰",
                    "제이케이옴므"
            };

    public static String[] STORENAME_SUB =
            {
                    "골져스 토일렛",
                    "데일리먼데이",
                    "디와이에스",
                    "레이트",
                    "스타일베리",
                    "원더플레이스",
                    "이란지",
                    "엠소울",
                    "윰",
                    "제이케이옴므"
            };

    public static String[] speechBubble =
            {
                    "오늘은 안빠지길…",
                    "간당 간당 하다잉",
                    "흐음…",
                    "살려줘…",
                    "언제까지 볼꺼야?",
                    "집에 가고 싶어…",
                    "렛츠고홈",
                    "time is running out",
                    "시간은 금이라고 친구"

            };

    public static Point[] shopDotLocation =
            {
                    new Point(63, 230),
                    new Point(110, 64),
                    new Point(527, 122),
                    new Point(489, 235),
                    new Point(150, 300),
                    new Point(377, 190),
                    new Point(320, 250),
                    new Point(300, 122),
                    new Point(535, 294),
                    new Point(374, 328)
            };
}
